Revit 2027 API
OverrideGraphicSettings.SetDetailLevel Method
 Sets the detail level.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public OverrideGraphicSettings SetDetailLevel(
	ViewDetailLevel detailLevel
)
Public Function SetDetailLevel (
	detailLevel As ViewDetailLevel
) As OverrideGraphicSettings
public:
OverrideGraphicSettings^ SetDetailLevel(
	ViewDetailLevel detailLevel
)
member SetDetailLevel :
        detailLevel : ViewDetailLevel -> OverrideGraphicSettings
Parameters
detailLevel ViewDetailLevel
 Value of the detail level. ViewDetailLevel.Undefined means no override is set.
Return Value
OverrideGraphicSettings
 Reference to the changed object.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
OverrideGraphicSettings Class
Autodesk.Revit.DB Namespace